DataProcessors/ТелеграмОбновлениеВерсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>ТелеграмОбновлениеВерсии</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТелеграмМетоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмМетоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсобеннаяСборка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметр1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбязательныйДляЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбязательныйДляПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмКонтекстСеансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмКонтекстСеансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТелеграмПараметрыКонтекста</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЧата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмПараметрыКонтекста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТелеграмОбновлениеВерсии/Ext/ManagerModule.bsl
Процедура ПерейтиНаВерсию1_00() Экспорт
	
	РегистрыСведений.ТелеграмМетоды.ЗагрузитьСлепок("Слепок20170525");
	Сообщить("Загружены данные в регистр ""Описание параметров методов""");
	
	Справочники.ТелеграмЭмодзи.ЗагрузитьСлепок("Слепок20170525");
	Сообщить("Загружена коллекция Эмодзи");
	
	УстановитьКонстантуВерсии("1.00");
	
КонецПроцедуры


Процедура ПерейтиНаВерсию1_01() Экспорт
	
	// ничего добавлять/изменять не требуется
	УстановитьКонстантуВерсии("1.01");
	
КонецПроцедуры


Процедура ПерейтиНаВерсию1_02() Экспорт
	
	ЗаполнитьИзмерениеБотРегистраТелеграмКонтекстСеансов();
	ДобавитьМетоды1_02();
	
	УстановитьКонстантуВерсии("1.02");
	
КонецПроцедуры


Процедура УстановитьКонстантуВерсии(НомерВерсии)
	
	МенеджерЗначения = Константы.ТелеграмТекущаяВерсия.СоздатьМенеджерЗначения();
	МенеджерЗначения.ДополнительныеСвойства.Вставить("Обновление");
	МенеджерЗначения.Значение = НомерВерсии;
	МенеджерЗначения.Записать();
	Сообщить("Переход на версию " + НомерВерсии + " завершен");
	
КонецПроцедуры


Процедура ЗаполнитьИзмерениеБотРегистраТелеграмКонтекстСеансов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВложенныйЗапрос.Ботов, 0) КАК Ботов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(1) КАК Ботов
	|	ИЗ
	|		Справочник.ТелеграмБоты КАК ТелеграмБоты) КАК ВложенныйЗапрос";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоБотов = Выборка.Ботов;
	
	Если КоличествоБотов = 0 Тогда
		Возврат;
	ИначеЕсли КоличествоБотов > 1 Тогда
		ТекстСообщения = "Не получилось заполнить измерение Бот регистра сведений ТелеграмКонтекстСеансов, так как ботов больше одного. Вам придётся сделать это самостоятельно.";
		Сообщить(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмБоты.Ссылка
	|ИЗ
	|	Справочник.ТелеграмБоты КАК ТелеграмБоты";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Бот = Выборка.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмКонтекстСеансов.Бот,
	|	ТелеграмКонтекстСеансов.ИдентификаторЧата,
	|	ТелеграмКонтекстСеансов.Параметр,
	|	ТелеграмКонтекстСеансов.Значение
	|ИЗ
	|	РегистрСведений.ТелеграмКонтекстСеансов КАК ТелеграмКонтекстСеансов
	|ГДЕ
	|	ТелеграмКонтекстСеансов.Бот = ЗНАЧЕНИЕ(Справочник.ТелеграмБоты.ПустаяСсылка)";
	
	НачатьТранзакцию();
	
	НаборЗаписей = РегистрыСведений.ТелеграмКонтекстСеансов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Бот.Установить(Справочники.ТелеграмБоты.ПустаяСсылка());
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.ТелеграмКонтекстСеансов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Бот.Установить(Бот);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Бот = Бот;
		НоваяЗапись.ИдентификаторЧата = Выборка.ИдентификаторЧата;
		НоваяЗапись.Параметр = Выборка.Параметр;
		НоваяЗапись.Значение = Выборка.Значение;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


Процедура ДобавитьМетоды1_02()
	
	РегистрыСведений.ТелеграмМетоды.ЗагрузитьСлепок("Обновление20171121", Ложь);
	Сообщить("Загружены новые данные в регистр ""Описание параметров методов"":");
	Сообщить("Добавлены параметры метода editMessageText");
	Сообщить("Добавлены параметры метода deleteMessage");
	
КонецПроцедуры


Функция ПолучитьОписаниеОбновления(НомерВерсии) Экспорт
	
	ИмяМакета = "ОписаниеОбновления" + НомерВерсии;
	ТекстОбновления = Обработки.ТелеграмОбновлениеВерсии.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	Возврат ТекстОбновления;
	
КонецФункции
